a = ['alex', 'bob', 'john']
b = ['alice', 'bob', 'anna']

# 1. Напиши функцию которая принимает два или более массиввов как тут и выводит массив со всеми именами без пересечений.
# Не используй сет

# 2. Напиши функциою которая принимает два ли более массивов как тут и выводит только те имена которые присутствуют во всех массивах сразу

# 3. Напиши функию которая принимает массим объектов и выдает сумму чека. Это должна быть "одна линия".
GOODS = [
    {'name': 'bread',   'price': 1.00, 'quantity': 3},
    {'name': 'milk',    'price': 2.00, 'quantity': 2},
    {'name': 'gold',    'price': 8.00, 'quantity': 5},
    {'name': 'silver',  'price': 2.00, 'quantity': 4},
]

# 4. напиши функцию которая принимает массив цифр типа [1,6,3] и выдает число из этих цифр, типа 163.